In [1]:
import pandas as pd
import sqlite3

In [2]:
# Conectamos con la base de datos .db. ESTA PARTE SIEMPRE HAY QUE HACERLA
connection = sqlite3.connect(r"data\sql-murder-mystery.db")

# Obtenemos un cursor que utilizaremos para hacer las queries. Es lo mismo al cntr enter en el dbeaver. PODEMOS UTILIZAR ESTE O PANDAS LO CREA, PERO MEJOR HACERLO.
crsr = connection.cursor()

In [3]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()
# opci´´on de mejora: añadir un try except, por si no hay nada en la tabla


    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

## Ayuda ##

1.

In [6]:
query1 = """ SELECT * 
FROM crime_scene_report
WHERE type = 'murder'
AND city = 'SQL City'
AND date = '20180115'
 """
#  cuidado con la fecha
sql_query(query1)

,date,type,description,city
0,20180115,murder,"Security footage shows that there were 2 witnesses. The first witness lives at the last house on ""Northwestern Dr"". The second witness, named Annabel, lives somewhere on ""Franklin Ave"".",SQL City

In [5]:
pd.set_option('display.max_colwidth', None)

In [23]:
witness = """ SELECT *
  FROM person
  WHERE address_street_name  = 'Northwestern Dr' OR (address_street_name  = 'Franklin Ave'  AND name LIKE 'Annabel%')
  ORDER BY address_number 
"""

sql_query(witness)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143
1,89906,Kinsey Erickson,510019,309,Northwestern Dr,635287661
2,15171,Weldon Penso,336999,311,Northwestern Dr,131379495
3,40336,Fredia Billeter,251082,404,Northwestern Dr,108056488
4,85280,Donn Duin,569122,540,Northwestern Dr,613873810
5,12711,Norman Apolito,667757,599,Northwestern Dr,778264744
6,75484,Del Tacderen,447887,607,Northwestern Dr,243821337
7,26758,Angelena Billman,942074,629,Northwestern Dr,341854756
8,39688,Abe Roeker,537445,689,Northwestern Dr,438969447
9,10010,Muoi Cary,385336,741,Northwestern Dr,828638512
10,40760,Renata Faver,976650,745,Northwestern Dr,547572040
11,25615,Olevia Morena,388477,812,Northwestern Dr,962831331
12,99826,Ivy Kazarian,994470,892,Northwestern Dr,208359813
13,44542,Ivory Mcgrevey,873842,897,Northwestern Dr,988557407
14,55130,Shiloh Huntoon,472118,951,Northwestern Dr,826647644
15,33415,Homer Simpson,108392,981,Northwestern Dr,871392019
16,29608,Willetta Lurvey,800568,1028,Northwestern Dr,843751378
17,18376,Josh Shi,653712,1091,Northwestern Dr,193899001
18,22239,Dusty Sigafus,710517,1125,Northwestern Dr,724386723
19,70485,Andera Kostelecky,354822,1252,Northwestern Dr,787423012
20,23960,Kristopher Lagerberg,658777,1392,Northwestern Dr,492912529
21,71924,Laurie Scronce,774116,1418,Northwestern Dr,254883636
22,81052,Calvin Czelusniak,471483,1516,Northwestern Dr,657531837
23,72076,Courtney Bordeaux,324614,1707,Northwestern Dr,347966356
24,51552,Bonita Knie,764124,1726,Northwestern Dr,597137908
25,88423,Teri Ehrich,510876,1879,Northwestern Dr,248637345
26,81885,Kurtis Masuda,934201,2108,Northwestern Dr,201272595
27,96178,Galina Khuu,450248,2183,Northwestern Dr,398518185
28,80921,Donovan Yackley,222395,2386,Northwestern Dr,515049359
29,34352,Vincenza Burkhardt,436470,2512,Northwestern Dr,197913046
30,53699,Christian Pagano,628433,2585,Northwestern Dr,644772304
31,54564,Sammie Sengun,217286,2590,Northwestern Dr,848854310
32,90397,Dionna Kranwinkle,797260,2678,Northwestern Dr,278964807
33,34155,Allyson Lazenson,814209,2840,Northwestern Dr,991150469
34,59307,Cyril Yongue,753524,2903,Northwestern Dr,866057839
35,98593,Jonah Toner,578982,2947,Northwestern Dr,745853548
36,44004,Alison Eska,327797,2951,Northwestern Dr,306417867
37,68690,Yer Modest,852404,3046,Northwestern Dr,419238039
38,51114,Christena Saffell,814284,3055,Northwestern Dr,247657547
39,23044,Val Portlock,924989,3143,Northwestern Dr,100593316
40,28360,Rashad Cascone,924517,3212,Northwestern Dr,838907424
41,53076,Boris Bijou,664914,3327,Northwestern Dr,401191868
42,36378,Freddie Ellzey,267882,3449,Northwestern Dr,474117596
43,87456,Leonora Wolfsberger,215868,3483,Northwestern Dr,565203106
44,93509,Emmitt Aceuedo,916706,3491,Northwestern Dr,979073160
45,19420,Cody Schiel,890431,3524,Northwestern Dr,947110049
46,96595,Coretta Cubie,303645,3631,Northwestern Dr,378403829
47,73368,Torie Thalmann,773862,3697,Northwestern Dr,341559436
48,53890,Sophie Tiberio,957671,3755,Northwestern Dr,442830147
49,17729,Lasonya Wildey,439686,3824,Northwestern Dr,917817122
50,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [24]:
witness = """ SELECT *
  FROM person
  WHERE name  = 'Morty Schapiro' OR (address_street_name  = 'Franklin Ave'  AND name LIKE 'Annabel%')
  ORDER BY address_number 
"""

sql_query(witness)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143
1,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [30]:
interview = """ SELECT *
FROM interview as i
INNER JOIN person as p
on p.id = i.person_id
WHERE p.id = '16371' OR p.id = '14887' """

sql_query(interview)

,person_id,transcript,id,name,license_id,address_number,address_street_name,ssn
0,14887,"I heard a gunshot and then saw a man run out. He had a ""Get Fit Now Gym"" bag. The membership number on the bag started with ""48Z"". Only gold members have those bags. The man got into a car with a plate that included ""H42W"".",14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949
1,16371,"I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.",16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [41]:
fit_now_memb = """ SELECT *
FROM get_fit_now_member as g

INNER JOIN person as p
on p.id = g.person_id

INNER JOIN drivers_license as d
on p.license_id = d.id

INNER JOIN get_fit_now_check_in as c
on g.id = c.membership_id

WHERE ((g.membership_status = 'gold' AND g.id LIKE '48Z%') OR d.plate_number LIKE  'H42W%') OR c.check_in_date = 20180901 """

sql_query(fit_now_memb)

,id,person_id,name,membership_start_date,membership_status,id,name,license_id,address_number,address_street_name,...,eye_color,hair_color,gender,plate_number,car_make,car_model,membership_id,check_in_date,check_in_time,check_out_time
0,48Z55,67318,Jeremy Bowers,20160101,gold,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",...,brown,brown,male,0H42W2,Chevrolet,Spark LS,48Z55,20180109,1530,1700

In [43]:
fit_now_memb = """ SELECT *
FROM interview as i

INNER JOIN person as p
on p.id = i.person_id



WHERE p.name  = 'Jeremy Bowers' """

sql_query(fit_now_memb)

,person_id,transcript,id,name,license_id,address_number,address_street_name,ssn
0,67318,"I was hired by a woman with a lot of money. I don't know her name but I know she's around 5'5"" (65"") or 5'7"" (67""). She has red hair and she drives a Tesla Model S. I know that she attended the SQL Symphony Concert 3 times in December 2017.\n",67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279

In [69]:
murder = """ INSERT INTO solution 
VALUES (1,'Jeremy Bowers')"""

sql_query(murder)

TypeError: 'NoneType' object is not iterable

In [71]:
asesino =  """ select value from solution"""
sql_query(asesino)

                                                                                                                                                                                                                                                                                                                                                                                                value
0  Congrats, you found the murderer! But wait, there's more... If you think you're up for a challenge, try querying the interview transcript of the murderer to find the real villain behind this crime. If you feel especially confident in your SQL skills, try to complete this final step with no more than 2 queries. Use this same INSERT statement with your new suspect to check your answer.

In [61]:
lady = """ SELECT *
FROM drivers_license as d

INNER JOIN person as p
on p.license_id = d.id


INNER JOIN facebook_event_checkin as f
on p.id = f.person_id

WHERE d.hair_color = 'red' AND car_model = 'Model S' AND d.gender = 'female'  AND f.date LIKE '201712%' """

sql_query(lady)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model,id,name,license_id,address_number,address_street_name,ssn,person_id,event_id,event_name,date
0,202298,68,66,green,red,female,500123,Tesla,Model S,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,99716,1143,SQL Symphony Concert,20171206
1,202298,68,66,green,red,female,500123,Tesla,Model S,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,99716,1143,SQL Symphony Concert,20171212
2,202298,68,66,green,red,female,500123,Tesla,Model S,99716,Miranda Priestly,202298,1883,Golden Ave,987756388,99716,1143,SQL Symphony Concert,20171229

In [63]:
lady_int = """SELECT *
FROM income 

WHERE ssn = 987756388 """

sql_query(lady_int)

         ssn  annual_income
0  987756388         310000

revisar SQL HAVING 
EN EL SELECT para concatenar resultados:  A || ' ' || B